module
public import VersoManual
import FPLean.Examples

open Verso.Genre Manual
open Verso Code External

open FPLean

set_option verso.exampleProject "../examples"
set_option verso.exampleModule "Examples.Monads.Class"

#doc (Manual) "Summary" =>
%%%
tag := "monads-summary"
%%%

# 副作用の符号化
%%%
tag := none
%%%

Leanは純粋な関数型言語である。
つまり、可変変数、ログ、例外といった副作用は備えていない。
しかし、ほとんどの副作用は、関数と帰納型や構造体を組み合わせて*符号化*できる。
たとえば可変状態は、初期状態から、最終状態と結果の組への関数として符号化でき、例外は、成功した終了とエラーのコンストラクタを持つ帰納型として符号化できる。

符号化された副作用の組はそれぞれ一つの型である。
その結果、プログラムがこれらの符号化された副作用を使うなら、それは型にはっきり現れる。
関数型プログラミングとは、プログラムが副作用を使えないということではなく、どの副作用を使うかについて*正直*であることを求めるだけである。
Leanの型シグネチャは、関数が期待する引数の型と返す結果の型だけでなく、使いうる副作用も記述する。

# モナド型クラス
%%%
tag := none
%%%

どこでも副作用を許す言語でも、純粋な関数型のプログラムは書ける。
たとえば{python}`2 + 3`は、副作用がまったくない正しいPythonのプログラムである。
同様に、副作用を持つプログラムを組み合わせるには、副作用が起きる順序を述べる手段が要る。
何しろ、変数を変更する前に例外が投げられるか後で投げられるかは重要である。

{anchorName FakeMonad}`Monad`型クラスはこの二つの重要な性質をとらえている。
メソッドは二つある。{anchorName FakeMonad}`pure`は副作用を持たないプログラムを表し、{anchorName FakeMonad}`bind`は副作用を持つプログラムをつなげる。
{anchorName FakeMonad}`Monad`インスタンスの契約は、{anchorName FakeMonad}`bind`と{anchorName FakeMonad}`pure`が実際に純粋な計算とつなげることをとらえているように保証する。

# モナドの{kw}`do`記法
%%%
tag := none
%%%

{kw}`do`記法は{moduleName}`IO`に限らず、どのモナドでも働く。
モナドを使うプログラムを、文を順に並べていく、文指向の言語を思わせる書き方で書ける。
さらに{kw}`do`記法は、入れ子にした動作など、いくつかの便利な略記法を可能にする。
{kw}`do`で書かれたプログラムは、裏で{lit}`>>=`の適用に変換される。

# 独自のモナド
%%%
tag := none
%%%

言語によって備えている副作用の組が異なる。
ほとんどの言語には可変変数とファイル入出力があるが、例外のような機能を持つ言語はすべてではない。
他の言語には、Iconの探索に基づくプログラムの実行、SchemeやRubyの継続、Common Lispの再開可能な例外のように、珍しい、あるいは独特な副作用がある。
モナドで副作用を符号化する利点は、プログラムが言語の備える副作用の組に縛られないことである。
Leanはどのモナドでも便利にプログラミングできるよう設計されているので、プログラマは用途に合わせて意味をなす副作用の組をちょうどよく選べる。

# {lit}`IO`モナド
%%%
tag := none
%%%

実世界に影響しうるプログラムは、Leanでは{moduleName}`IO`の動作として書く。
{moduleName}`IO`は多くのモナドのうちの一つである。
{moduleName}`IO`モナドは状態と例外を符号化する。状態は世界の状態を追跡するのに使い、例外は失敗と復帰を模す。
