module
public import VersoManual
import FPLean.Examples

open Verso.Genre Manual
open Verso Code External

open FPLean

set_option verso.exampleProject "../examples"
set_option verso.exampleModule "Examples.Classes"


set_option pp.rawOnError true

#doc (Manual) "Summary" =>
%%%
tag :="type-classes-summary"
%%%

# 型クラスとオーバーロード
%%%
tag := none
%%%

型クラスは、関数と演算子をオーバーロードするためのLeanの仕組みである。
多相関数は複数の型で使えるが、どの型で使っても同じように振る舞う。
たとえば、二つのリストを連結する多相関数は、リストの要素の型に関係なく使えるが、どの型かによって振る舞いを変えることはできない。
一方、型クラスでオーバーロードされた操作も、複数の型で使える。
ただし、型ごとにその操作の実装が必要である。
つまり、どの型が与えられるかによって振る舞いを変えられる。

*型クラス*は、名前、引数、そして型の付いた名前をいくつか並べた本体から成る。
名前はオーバーロードされた操作を指す手段であり、引数は定義のどの部分をオーバーロードできるかを決め、本体はオーバーロードできる操作の名前と型シグネチャを与える。
オーバーロードできる操作をそれぞれ、その型クラスの{deftech}*メソッド*と呼ぶ。
型クラスは、一部のメソッドについて他のメソッドを使った既定の実装を用意できる。そうすれば、必要のないときに実装者が手で各オーバーロードを定義せずに済む。

型クラスの{deftech}*インスタンス*は、与えられた引数に対するメソッドの実装を提供する。
インスタンスは多相でもよく、その場合はさまざまな引数に対して働く。また、特定の型により効率のよい版がある場合には、既定のメソッドのより具体的な実装を任意で提供できる。

型クラスの引数は、{deftech}*入力パラメータ*（既定）か、{deftech}*出力パラメータ*（{moduleName}`outParam`修飾子で示す）のどちらかである。
Leanは、入力パラメータがすべてメタ変数でなくなるまでインスタンスの探索を始めない。出力パラメータは探索の途中で解決されてよい。
型クラスの引数は型である必要はない。普通の値でもよい。
自然数のリテラルをオーバーロードするのに使う{moduleName}`OfNat`型クラスは、オーバーロードする{moduleName}`Nat`自体を引数に取り、これによりインスタンスが許す数を制限できる。

インスタンスには{anchorTerm defaultAdd}`@[default_instance]`属性を付けられる。
インスタンスが既定のインスタンスである場合、型にメタ変数があるためにLeanがインスタンスを見つけられないときに、代わりの候補として選ばれる。

# よく使う構文のための型クラス
%%%
tag := none
%%%

Leanの中置演算子のほとんどは型クラスでオーバーロードされている。
たとえば加算演算子は{moduleName}`Add`という型クラスに対応する。
これらの演算子のほとんどには対応する異種の版があり、二つの引数の型が同じでなくてもよい。
これらの異種の演算子は、名前が{lit}`H`で始まる版のクラス（{moduleName}`HAdd`など）でオーバーロードされている。

参照の記法は{moduleName}`GetElem`という型クラスでオーバーロードされており、証明が関わる。
{moduleName}`GetElem`は二つの出力パラメータを持つ。コレクションから取り出す要素の型と、添字の値がそのコレクションで範囲内にある証拠として何が認められるかを決める関数である。
この証拠は命題で記述され、配列の参照を使うときにLeanはその命題を証明しようとする。
リストや配列の参照が範囲内にあることをLeanがコンパイル時に調べられない場合、参照の記法に{lit}`?`を付けると、その検査を実行時まで先延ばしできる。

# ファンクタ
%%%
tag := none
%%%


ファンクタは、マップの操作に対応した多相型である。
このマップの操作は、他の構造を変えずに、すべての要素を「その場で」変換する。
たとえばリストはファンクタであり、マップの操作はリストの要素を落としたり、複製したり、混ぜたりしてはならない。

ファンクタは{anchorName FunctorDef}`map`を持つことで定義されるが、Leanの{anchorName FunctorDef}`Functor`型クラスには既定のメソッドがもう一つあり、定数関数を値にマップして、多相型変数で与えられる型の値をすべて同じ新しい値に置き換える役割を担う。
ファンクタによっては、構造全体をたどるより効率よく行える。

# インスタンスの導出
%%%
tag := none
%%%


多くの型クラスには、ごく標準的な実装がある。
たとえば、ブール値の等価性のクラス{moduleName}`BEq`は通常、二つの引数が同じコンストラクタで作られているかを調べ、次にそれらの引数がすべて等しいかを調べる形で実装する。
これらのクラスのインスタンスは*自動で*作れる。

帰納型や構造体を定義するとき、宣言の末尾に{kw}`deriving`の句を書くと、インスタンスが自動で作られる。
さらに、{kw}`deriving instance`{lit}` ... `{kw}`for`{lit}` ...`コマンドをデータ型の定義の外で使うことでも、インスタンスを生成できる。
インスタンスを導出できるクラスはそれぞれ特別な扱いが必要なので、すべてのクラスを導出できるわけではない。

# 型強制
%%%
tag := none
%%%


型強制により、Leanは、本来ならコンパイル時のエラーになるところを、ある型のデータを別の型に変換する関数の呼び出しを挿入して乗り切れる。
たとえば、任意の型{anchorName CoeOption}`α`から型{anchorTerm CoeOption}`Option α`への型強制により、{anchorName CoeOption}`some`コンストラクタを使わずに値を直接書けるので、{anchorName CoeOption}`Option`はオブジェクト指向言語のnull許容型に近い働きをする。

型強制にはいくつかの種類がある。
それぞれ別の種類のエラーを乗り切り、それぞれ独自の型クラスで表される。
{anchorName CoeOption}`Coe`クラスは型エラーを乗り切るのに使う。
型{anchorName Coe}`β`を期待する文脈で、型{anchorName Coe}`α`の式があるとき、Leanはまず{anchorName Coe}`α`を{anchorName Coe}`β`に変換できる型強制の連鎖をつなげようとし、それができないときにだけエラーを表示する。
{moduleName}`CoeDep`クラスは、型強制する具体的な値を追加の引数として取り、その値についてさらに型クラス探索を行うことも、インスタンスでコンストラクタを使って変換の範囲を限定することもできる。
{moduleName}`CoeFun`クラスは、関数適用をコンパイルするときに本来なら「関数ではない」というエラーになるところを引き受け、可能なら関数の位置にある値を実際の関数に変換できる。
