module
public import VersoManual
import FPLean.Examples


open Verso.Genre Manual
open Verso Code External


open FPLean


set_option verso.exampleProject "../examples"
set_option verso.exampleModule "Examples.HelloWorld"

#doc (Manual) "Summary" =>
%%%
tag := "hello-world-summary"
%%%

# 評価と実行
%%%
tag := none
%%%

副作用とは、数式の評価を超えてプログラムの実行に伴う事柄であり、ファイルの読み込み、例外の送出、産業機械の起動などが含まれる。
ほとんどの言語は評価の途中で副作用を許すが、Leanは許さない。
代わりに、Leanには{moduleName}`IO`という型があり、副作用を使うプログラムの*記述*を表す。
その記述は、言語の実行時システムが実行する。実行時システムは、個々の計算を行うためにLeanの式評価器を呼び出す。
{moduleTerm}`IO α`型の値を*{moduleName}`IO`アクション*と呼ぶ。
最も単純なのは{moduleName}`pure`で、引数を返し、実際の副作用はない。

{moduleName}`IO`アクションは、世界全体を引数に取り、副作用が起きた新しい世界を返す関数としても理解できる。
舞台裏では、{moduleName}`IO`ライブラリが、世界が複製されたり作られたり壊されたりしないことを保証する。
この副作用のモデルは、宇宙全体をメモリに収めることができないので実際には実装できないが、現実の世界はプログラムの中で受け渡されるトークンで表せる。

プログラムが起動すると、{moduleName}`IO`アクション{anchorName MainTypes}`main`が実行される。
{anchorName MainTypes}`main`は次の三つの型のいずれかを持つ。
 * {anchorTerm MainTypes}`main : IO Unit`は、コマンドライン引数を読めず、常に終了コード{anchorTerm MainTypes}`0`を返す単純なプログラムに使う。
 * {anchorTerm MainTypes}`main : IO UInt32`は、引数を取らず、成功か失敗を知らせうるプログラムに使い、
 * {anchorTerm MainTypes}`main : List String → IO UInt32`は、コマンドライン引数を取り、成功か失敗を知らせるプログラムに使う。


# {lit}`do`記法
%%%
tag := none
%%%

Leanの標準ライブラリには、ファイルの読み書きや標準入出力とのやり取りといった副作用を表す基本的な{moduleName}`IO`アクションが多数用意されている。
これらの基本的な{moduleName}`IO`アクションは、{kw}`do`記法でより大きな{moduleName}`IO`アクションに組み立てる。{kw}`do`記法は、副作用のあるプログラムの記述を書くために言語に組み込まれたドメイン固有言語である。
{kw}`do`式には*文*の並びが入り、文は次のいずれかである。
 * {moduleName}`IO`アクションを表す式、
 * {kw}`let`と{lit}`:=`による普通のローカル定義（定義した名前は与えられた式の値を指す）、または
 * {kw}`let`と{lit}`←`によるローカル定義（定義した名前は与えられた式の値を実行した結果を指す）。

{kw}`do`で書いた{moduleName}`IO`アクションは、文を一つずつ実行する。

さらに、{kw}`do`の直下にある{kw}`if`式と{kw}`match`式は、各枝に暗黙にそれぞれの{kw}`do`があるものとして扱われる。
{kw}`do`式の中では、括弧の直下に左矢印がある式が*入れ子のアクション*である。
Leanコンパイラは、それらを最も内側の{kw}`do`（{kw}`match`式や{kw}`if`式の枝に暗黙に属する{kw}`do`であることもある）へ暗黙に持ち上げ、一意な名前を与える。
その一意な名前が、入れ子のアクションがあった場所を置き換える。


# プログラムのコンパイルと実行
%%%
tag := none
%%%

{moduleName}`main`の定義がある1ファイルだけのLeanプログラムは、{lit}`lean --run FILE`で実行できる。
単純なプログラムを始めるにはこれでよいが、ほとんどのプログラムはいずれ、実行前にコンパイルする複数ファイルのプロジェクトに移行する。

Leanのプロジェクトは*パッケージ*として整理する。パッケージは、ライブラリと実行ファイルの集まりに、依存関係の情報とビルド設定を添えたものである。
パッケージはLeanのビルドツールであるLakeで記述する。
新しいディレクトリにLakeのパッケージを作るには{lit}`lake new`を、現在のディレクトリに作るには{lit}`lake init`を使う。
Lakeのパッケージ設定もまたドメイン固有言語である。
プロジェクトをビルドするには{lit}`lake build`を使う。

# 部分性
%%%
tag := none
%%%

式の評価という数学的モデルに従うことの一つの帰結は、すべての式が値を持たなければならないことである。
これにより、データ型のすべてのコンストラクタを網羅しないパターンマッチングと、無限ループに陷りうるプログラムの両方が排除される。
Leanは、すべての{kw}`match`式がすべての場合を網羅すること、そしてすべての再帰関数が構造的再帰であるか、停止性の明示的な証明を持つことを保証する。

しかし、現実のプログラムの中には、POSIXのストリームのように無限になりうるデータを扱うため、無限にループする可能性を必要とするものがある。
Leanには逃げ道がある。定義に{kw}`partial`と付けた関数には停止性を要求しない。
ただし、代償がある。
型はLean言語の第一級の要素なので、関数は型を返せる。
しかし、partialな関数は型検査のときに評価されない。関数の無限ループが型検査器を無限ループに陷らせうるためである。
さらに、数学的な証明はpartialな関数の定義を調べられないので、それを使うプログラムは形式的な証明に向かない。
