module
public import VersoManual
import FPLean.Examples

open Verso.Genre Manual
open Verso.Code.External

open FPLean

set_option verso.exampleProject "../examples"
set_option verso.exampleModule "Examples.MonadTransformers"

#doc (Manual) "Summary" =>
%%%
tag := "monad-transformer-summary"
%%%

# モナドの組み合わせ
%%%
tag := none
%%%

モナドを一から書くとき、それぞれの副作用をそのモナドに加える方法を記述する傾向のある設計パターンがある。
リーダーの副作用はモナドの型をリーダーの環境からの関数にすることで加え、状態の副作用は初期状態から、値と最終状態の組への関数を含めることで加え、失敗や例外は戻り値の型に直和型を含めることで加え、ログやその他の出力は戻り値の型に直積型を含めることで加える。
既存のモナドも戻り値の型の一部にでき、その副作用を新しいモナドに含められる。

これらの設計パターンは、ある基盤のモナドに副作用を加える*モナド変換子*を定義することで、再利用できるソフトウェア部品のライブラリになる。
モナド変換子はより単純なモナドの型を引数に取り、強化されたモナドの型を返す。
モナド変換子は少なくとも次のインスタンスを提供すべきである。
 1. 内側の型がすでにモナドであることを前提とする{anchorName Summary}`Monad`インスタンス
 2. 内側のモナドの動作を変換後のモナドへ変換する{anchorName Summary}`MonadLift`インスタンス

モナド変換子は多相的な構造体や帰納的データ型として実装してもよいが、ほとんどの場合はその下のモナドの型から強化されたモナドの型への関数として実装する。

# 副作用のための型クラス
%%%
tag := none
%%%

よくある設計パターンは、ある副作用を、その副作用を持つモナドと、それを別のモナドに加えるモナド変換子と、その副作用への一般的なインターフェースを与える型クラスを定義することで実装することである。
これにより、必要な副作用を述べるだけのプログラムを書けるようになり、呼び出し側は適切な副作用を持つどのモナドでも与えられる。

補助的な型の情報（たとえば状態を提供するモナドの状態の型や、例外を提供するモナドの例外の型）が出力パラメータであることも、そうでないこともある。
出力パラメータは、それぞれの種類の副作用を一度だけ使う簡単なプログラムには最も役に立つが、同じ副作用を複数使うプログラムでは、型検査器が早すぎる段階で間違った型に決めてしまう危険がある。
したがって通常は両方の版が用意され、普通のパラメータを使う版の型クラスの名前は{lit}`-Of`で終わる。

# モナド変換子は可換でない
%%%
tag := none
%%%

モナドの変換子の順序を変えると、そのモナドを使うプログラムの意味が変わりうることに注意することが重要である。
たとえば{anchorName Summary}`StateT`と{anchorTerm Summary}`ExceptT`の順序を入れ替えると、例外が投げられたときに状態の変更が失われるプログラムにも、変更が残るプログラムにもなる。
ほとんどの命令型言語が与えるのは後者だけだが、モナド変換子が与える柔軟さが増したことで、目の前の作業に正しいほうを選ぶための思考と注意が要る。

# モナド変換子の{kw}`do`記法
%%%
tag := none
%%%

Leanの{kw}`do`ブロックは、ある値でブロックを終わらせる早期リターン、局所的な可変変数、{kw}`break`と{kw}`continue`を伴う{kw}`for`ループ、枝が一つの{kw}`if`文を支える。
これは証明を書くのにLeanを使う妨げになる命令型の機能を持ち込んでいるように見えるかもしれないが、実際には、ある種のよくあるモナド変換子の使い方のための、より便利な構文にすぎない。
裏では、その{kw}`do`ブロックを書いているモナドが、{anchorName Summary}`ExceptT`と{anchorName Summary}`StateT`を適切に使って変換され、これらの追加の副作用を支える。
