module
public import VersoManual
import FPLean.Examples

open Verso.Genre Manual
open Verso.Code.External

open FPLean

set_option verso.exampleProject "../examples"
set_option verso.exampleModule "Examples.DependentTypes"

#doc (Manual) "Summary" =>
%%%
tag := "dependent-types-summary"
%%%

# 依存型
%%%
tag := none
%%%

型が関数の呼び出しや普通のデータのコンストラクタのような型でないコードを含む依存型は、型システムの表現力を大きく高める。
引数の*値*から型を*計算*できるということは、関数の戻り値の型が、与えられる引数によって変わりうるということである。
これはたとえば、データベースの問い合わせの結果の型を、そのデータベースのスキーマと発行した具体的な問い合わせに依存させ、問い合わせの結果に失敗しうるキャスト演算を一切必要としないようにするのに使える。
問い合わせが変われば、それを実行して得られる型も変わり、コンパイル時にすぐ手がかりが得られる。

関数の戻り値の型がある値に依存するとき、その値をパターンマッチングで分析すると、値を表す変数がパターンの中のコンストラクタで置き換えられ、型が*洗練*されうる。
関数の型シグネチャは、戻り値の型が引数の値にどう依存するかを記録し、次にパターンマッチングが、起こりうる引数ごとに戻り値の型をどう満たせるかを説明する。

型に現れる普通のコードは型検査の間に実行されるが、無限にループしうる{kw}`partial`関数は呼ばれない。
この計算は主に、{ref "evaluating"}[この本のごく最初]で紹介した普通の評価の規則に従い、最終的な値が見つかるまで式が次々と値で置き換えられる。
型検査の間の計算は、実行時の計算と重要な違いがある。型にある値が、まだ値の分かっていない*変数*であることがあるのである。
このような場合、パターンマッチングが「行き詰まり」、特定のコンストラクタが選ばれる（たとえばパターンマッチングによって）まで、あるいはそれが起きない限り、先に進まない。
型の段階の計算は一種の部分評価と見なせる。十分に分かっている部分だけを評価すればよく、他の部分はそのままにされる。

# 宇宙のパターン
%%%
tag := none
%%%

依存型を扱うときによくあるパターンは、型システムのある部分集合を区切って切り出すことである。
たとえば、データベースの問い合わせライブラリは、長さの変わる文字列、長さの決まった文字列、一定の範囲の数を返せても、関数や利用者が定義したデータ型、{anchorName otherEx}`IO`の動作を返すことは決してない。
型システムの分野に固有の部分集合は、まず望む型の構造に合うコンストラクタを持つデータ型を定義し、次にそのデータ型の値を紛れもない型へ解釈する関数を定義することで定められる。
そのコンストラクタを、当該の型の*コード*と呼び、このパターン全体を*タルスキ流の宇宙*と呼ぶことがある。文脈から{anchorTerm otherEx}`Type 3`や{anchorTerm otherEx}`Prop`のような宇宙のことを指していないと明らかなときは、単に*宇宙*と呼ぶこともある。

独自の宇宙は、関心のある型ごとにインスタンスを持つ型クラスを定義する代わりのものである。
型クラスは拡張できるが、拡張できることが常に望ましいわけではない。
独自の宇宙を定義することには、型を直接使うことに比べていくつかの利点がある。
 * 等しさの検査やシリアライズのように、その宇宙の*どの*型でも働く一般的な操作を、コードについての再帰で実装できる。
 * 外部のシステムが受け付ける型を正確に表せ、コードのデータ型の定義が、何が期待できるかの記録として働く。
 * Leanのパターンマッチングの完全性の検査器が、コードの見落としがないことを保証する。一方、型クラスに基づく解決策は、インスタンスの欠落のエラーを利用側のコードまで先延ばしにする。


# 添字付き族
%%%
tag := none
%%%

データ型は二種類の引数を取れる。*パラメータ*はそのデータ型のどのコンストラクタでも同じであり、*添字*はコンストラクタ間で変わりうる。
添字をあるように選ぶと、そのデータ型の一部のコンストラクタだけが使える。
たとえば、{anchorName otherEx}`Vect.nil`は長さの添字が{anchorTerm Vect}`0`のときにだけ使え、{anchorName consNotLengthN}`Vect.cons`は長さの添字がある{anchorName Vect}`n`について{anchorTerm Vect}`n+1`のときにだけ使える。
通常、パラメータはデータ型の宣言のコロンの前に名前付きの引数として書き、添字はコロンの後の関数型の引数として書くが、Leanはコロンの後の引数がパラメータとして使われている場合を推論できる。

添字付き族はデータ間の複雑な関係を表現でき、それらはすべてコンパイラに調べられる。
そのデータ型の不変条件を直接符号化でき、一時的にも破る方法がない。
データ型の不変条件をコンパイラに伝えることには大きな利点がある。コンパイラが、それらを満たすために何をすべきかをプログラマに伝えられるようになるのである。
コンパイル時のエラー、特にアンダースコアから生じるものを戦略的に使うと、プログラミングの思考過程の一部をLeanに任せられ、プログラマの頭を他のことに向けられる。

添字付き族を使って不変条件を符号化すると、難点が生じうる。
第一に、不変条件ごとに独自のデータ型が必要になり、それは独自の支援ライブラリを必要とする。
何しろ{anchorName otherEx}`List.zip`と{anchorName VectZip}`Vect.zip`は差し替えられない。
これがコードの重複を招きうる。
第二に、添字付き族を使いやすくするには、型に使う関数の再帰の構造が、型検査されるプログラムの再帰の構造と一致する必要がある。
添字付き族を使ったプログラミングは、都合のよい一致が起きるように取り計らう技である。
欠けた一致を等しさの証明への訴えで回避することは可能だが、それは難しく、分かりにくい正当化にまみれたプログラムを生む。
第三に、型検査の間に大きな値に対して複雑なコードを走らせると、コンパイル時の速度低下を招きうる。
複雑なプログラムでこうした速度低下を避けるには、専門的な技法が要ることがある。

# 定義上の等しさと命題としての等しさ
%%%
tag := none
%%%

Leanの型検査器は、ときどき、二つの型を差し替え可能と見なすべきかを調べねばならない。
型は任意のプログラムを含みうるので、したがって任意のプログラムの等しさを調べられねばならない。
しかし、任意のプログラムが完全に一般的な数学的な等しさを持つかを調べる効率のよい算法はない。
これを回避するため、Leanには二つの等しさの考え方がある。

 * *定義上の等しさ*は、等しさの過小な近似であり、本質的には、計算と束縛変数の名前替えを除いた構文的な表現の等しさを調べる。Leanは、必要な場面で定義上の等しさを自動で調べる。

 * *命題としての等しさ*は、プログラマが明示的に証明し、明示的に呼び出さねばならない。その代わり、Leanは証明が妥当であることと、その呼び出しが正しいゴールを達成していることを自動で調べる。

この二つの等しさの考え方は、プログラマとLean自体の分業を表している。
定義上の等しさは単純だが自動であり、命題としての等しさは手動だが表現力がある。
命題としての等しさは、そうでなければ行き詰まる型の中のプログラムの行き詰まりを解くのに使える。

しかし、型の段階の計算の行き詰まりを解くのに命題としての等しさを頻繁に使うのは、通常はコードの臭いである。
それは通常、都合のよい一致がうまく設計されていなかったことを意味し、型と添字を設計し直すか、必要な不変条件を強制する別の技法を使うほうが普通はよい。
代わりに、プログラムが仕様を満たすことを証明するのに、あるいは部分型の一部として命題としての等しさを使うなら、疑う理由は少ない。
