module
public import VersoManual
import FPLean.Examples

open Verso.Genre Manual
open Verso Code External

open FPLean


set_option verso.exampleProject "../examples"
set_option verso.exampleModule "Examples.Intro"

#doc (Manual) "Summary" =>
%%%
tag := "getting-to-know-summary"
%%%

# 式の評価
%%%
tag := none
%%%

Leanでは、計算は式を評価することで起こる。
これは数式の普通の規則に従う。通常の計算順序で部分式をその値に置き換えていき、式全体が値になるまで続ける。
{kw}`if`や{kw}`match`を評価するとき、条件やマッチの対象の値が決まるまで、枝の中の式は評価されない。

変数は、一度値を与えたら変わることはない。
数学と同じで、ほとんどのプログラミング言語とは違って、Leanの変数は単なる値の置き場であり、新しい値を書き込めるアドレスではない。
変数の値は、{kw}`def`による大域的な定義、{kw}`let`によるローカル定義、関数の名前付き引数、パターンマッチングのいずれから来ることもある。

# 関数
%%%
tag := none
%%%

Leanの関数は第一級の値である。他の関数に引数として渡せ、変数に入れておけ、他の値と同じように使える。
Leanの関数は、必ず引数を一つだけ取る。
複数の引数を取る関数を表すために、Leanはカリー化という手法を使う。最初の引数を渡すと、残りの引数を待つ関数が返る。
引数を取らない関数を表すには、{moduleName}`Unit`型を使う。これ以上ないほど情報の少ない引数である。

関数を作る方法は主に三つある。
1. 無名関数は{kw}`fun`で書く。
   たとえば{anchorName fragments}`Point`のフィールドを入れ替える関数は{anchorTerm swapLambda}`fun (point : Point) => { x := point.y, y := point.x : Point }`と書ける。
2. ごく簡単な無名関数は、括弧の中に一つ以上の中央の点{anchorTerm subOneDots}`·`を書いて表す。
   中央の点はそれぞれ関数の引数になり、括弧が本体の範囲を決める。
   たとえば、引数から1を引く関数は{anchorTerm subOneDots}`fun x => x - 1`ではなく{anchorTerm subOneDots}`(· - 1)`と書ける。
3. {kw}`def`や{kw}`let`で、引数の並びを書くか、パターンマッチングの記法を使って関数を定義できる。

# 型
%%%
tag := none
%%%

Leanは、すべての式が型を持つことを検査する。
{anchorName fragments}`Int`、{anchorName fragments}`Point`、{anchorTerm fragments}`{α : Type} → Nat → α → List α`、{anchorTerm fragments}`Option (String ⊕ (Nat × String))`のような型は、式が最終的に持ちうる値を記述する。
他の言語と同じく、Leanの型でもプログラムの簡潔な仕様を表せ、それをLeanコンパイラが検査するので、ある種の単体テストは不要になる。
ほとんどの言語と違い、Leanの型は任意の数学も表せる。プログラムと定理証明の世界が一つになるのである。
Leanを定理証明に使う話は本書の範囲外だが、この話題については_[Theorem Proving in Lean 4](https://leanprover.github.io/theorem_proving_in_lean4/)_に詳しい説明がある。

式によっては複数の型を与えられる。
たとえば{lit}`3`は{anchorName fragments}`Int`にも{anchorName fragments}`Nat`にもなりうる。
Leanでは、これは同じものに二つの型があるのではなく、{anchorName fragments}`Nat`型の式と{anchorName fragments}`Int`型の式という別々の式が、たまたま同じ書き方をされているのだと考える。

Leanが型を自動で決められることもあるが、型はしばしば利用者が指定しなければならない。
Leanの型システムの表現力が高いためである。
Leanが型を見つけられても、望む型になるとは限らない。{lit}`3`を{anchorName fragments}`Int`として使いたくても、他に制約がなければLeanは{anchorName fragments}`Nat`型を与える。
一般に、ほとんどの型を明示し、ごく明らかな型だけをLeanに任せるのがよい。
そうするとLeanのエラーメッセージが良くなり、プログラマの意図も伝わりやすくなる。

関数やデータ型の中には、型を引数に取るものがある。
これを*多相*という。
多相性のおかげで、リストの要素の型を気にせずにリストの長さを計算する、といったプログラムが書ける。
Leanでは型が第一級なので、多相性に特別な記法は要らず、型も他の引数と同じように渡す。
関数の型で引数に名前を付けると、後ろの型がその名前を参照できる。関数を引数に適用したときの結果の型は、引数の名前を実際に適用した値で置き換えて求められる。

# 構造体と帰納型
%%%
tag := none
%%%

まったく新しいデータ型は、{kw}`structure`や{kw}`inductive`の機能でLeanに導入できる。
この新しい型は、定義が他とまったく同じでも、他のどの型とも同じものとは見なされない。
データ型には、その値をどう作れるかを示す*コンストラクタ*があり、各コンストラクタは何個かの引数を取る。
Leanのコンストラクタは、オブジェクト指向言語のコンストラクタとは違う。Leanのコンストラクタはデータを入れておくだけのものであり、割り当てたオブジェクトを初期化する能動的なコードではない。

通常、{kw}`structure`は直積型（任意の個数の引数を取るコンストラクタを一つだけ持つ型）を導入するのに使い、{kw}`inductive`は直和型（異なるコンストラクタを多数持つ型）を導入するのに使う。
{kw}`structure`で定義したデータ型には、フィールドごとにアクセサ関数が一つ用意される。
構造体も帰納的データ型も、パターンマッチングで扱える。パターンマッチングは、コンストラクタを呼ぶときの記法の一部を使って、コンストラクタの中に入っている値を取り出す。
パターンマッチングがあるので、値の作り方を知っていれば、その扱い方も分かる。

# 文字列とスライス
%%%
tag := none
%%%

文字列は文字の並びであり、文字はUnicodeのコードポイントである。
実行時の表現は、UTF-8エンコーディングのバイト列と、キャッシュされた文字数のフィールドである。
Leanは純粋関数型言語なので、文字列から空白を取り除くような操作は、通常なら文字列のコピーが必要になる。
多くの文字列関数が{tech}[文字列スライス]を返すようにすることで、これを避けている。文字列スライスは、文字列への参照と開始位置と終了位置の組である。
スライスは開始位置と終了位置を更新して操作できるので、コピーが不要になる。

# 再帰
%%%
tag := none
%%%

定義しようとしている名前がその定義の中で使われているとき、その定義は再帰的である。
Leanはプログラミング言語であると同時に対話型の定理証明支援系なので、再帰的な定義には制約がある。
Leanの論理の側面では、循環した定義は論理的な矛盾を招きうる。

再帰的な定義がLeanの論理を損なわないようにするため、Leanは、すべての再帰関数がどのような引数で呼ばれても停止することを証明できなければならない。
実際には、再帰呼び出しがすべて構造的に小さい入力に対して行われること（常に基底ケースに近づくことが保証される）、あるいは関数が常に停止する別の証拠を利用者が与えることのどちらかが必要である。
同様に、再帰的な帰納型では、その型*から*の関数を引数に取るコンストラクタを持てない。停止しない関数を表現できてしまうためである。
